Stock Market - Analysis Phase

1- Import Libraries

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

2- Load the dataset

In [2]:
df = pd.read_csv("../data/sp500.csv")

In [3]:
df.head()
# there is a price column but without price values , no Date and Adj Close columns, first 2 rows are mess,

         Date      Close       High        Low       Open   Volume
0  1950-01-05  16.930000  16.930000  16.930000  16.930000  2550000
1  1950-01-06  16.980000  16.980000  16.980000  16.980000  2010000
2  1950-01-09  17.080000  17.080000  17.080000  17.080000  2520000
3  1950-01-10  17.030001  17.030001  17.030001  17.030001  2160000
4  1950-01-11  17.090000  17.090000  17.090000  17.090000  2630000

In [4]:
df.describe()

              Close          High           Low          Open        Volume
count  19139.000000  19139.000000  19139.000000  19139.000000  1.913900e+04
mean     922.725553    927.854761    916.873184    922.537626  1.242619e+09
std     1325.995169   1332.666198   1318.322896   1325.784596  1.813417e+09
min       16.670000     16.670000     16.670000     16.670000  0.000000e+00
25%       89.625000     90.370003     88.884998     89.605000  1.072000e+07
50%      273.910004    275.619995    271.769989    273.910004  1.488000e+08
75%     1270.579956   1278.190002   1261.910034   1270.414978  2.516265e+09
max     6978.600098   7002.279785   6963.459961   7002.000000  1.145623e+10

2(a) - Fix Loading issues

In [5]:
# df=pd.read_csv("../data/sp500.csv",skiprows=2)

In [6]:
df.head()

         Date      Close       High        Low       Open   Volume
0  1950-01-05  16.930000  16.930000  16.930000  16.930000  2550000
1  1950-01-06  16.980000  16.980000  16.980000  16.980000  2010000
2  1950-01-09  17.080000  17.080000  17.080000  17.080000  2520000
3  1950-01-10  17.030001  17.030001  17.030001  17.030001  2160000
4  1950-01-11  17.090000  17.090000  17.090000  17.090000  2630000

2(b)- Rename the columns

In [7]:
df.columns=["Date","Close","High","Low","Open","Volume"]

In [8]:
df.head()

         Date      Close       High        Low       Open   Volume
0  1950-01-05  16.930000  16.930000  16.930000  16.930000  2550000
1  1950-01-06  16.980000  16.980000  16.980000  16.980000  2010000
2  1950-01-09  17.080000  17.080000  17.080000  17.080000  2520000
3  1950-01-10  17.030001  17.030001  17.030001  17.030001  2160000
4  1950-01-11  17.090000  17.090000  17.090000  17.090000  2630000

In [9]:
df.info()
# Date was object type and I changed it to datetime type (next cell)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19139 entries, 0 to 19138
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    19139 non-null  object
 1   Close   19139 non-null  float64
 2   High    19139 non-null  float64
 3   Low     19139 non-null  float64
 4   Open    19139 non-null  float64
 5   Volume  19139 non-null  int64
dtypes: float64(4), int64(1), object(1)
memory usage: 897.3+ KB

2(c)- Date datatype; from object to datetime

In [10]:
df["Date"] = pd.to_datetime(df["Date"])

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19139 entries, 0 to 19138
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    19139 non-null  datetime64[ns]
 1   Close   19139 non-null  float64
 2   High    19139 non-null  float64
 3   Low     19139 non-null  float64
 4   Open    19139 non-null  float64
 5   Volume  19139 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 897.3 KB

In [12]:
df.head()

        Date      Close       High        Low       Open   Volume
0 1950-01-05  16.930000  16.930000  16.930000  16.930000  2550000
1 1950-01-06  16.980000  16.980000  16.980000  16.980000  2010000
2 1950-01-09  17.080000  17.080000  17.080000  17.080000  2520000
3 1950-01-10  17.030001  17.030001  17.030001  17.030001  2160000
4 1950-01-11  17.090000  17.090000  17.090000  17.090000  2630000

2(d)- Sort and Indexing

In [13]:
df = df.sort_values("Date")
df=df.set_index("Date") # now Date is the index of my dataset

In [14]:
df.head()

                Close       High        Low       Open   Volume
Date
1950-01-05  16.930000  16.930000  16.930000  16.930000  2550000
1950-01-06  16.980000  16.980000  16.980000  16.980000  2010000
1950-01-09  17.080000  17.080000  17.080000  17.080000  2520000
1950-01-10  17.030001  17.030001  17.030001  17.030001  2160000
1950-01-11  17.090000  17.090000  17.090000  17.090000  2630000

In [15]:
df.describe()

              Close          High           Low          Open        Volume
count  19139.000000  19139.000000  19139.000000  19139.000000  1.913900e+04
mean     922.725553    927.854761    916.873184    922.537626  1.242619e+09
std     1325.995169   1332.666198   1318.322896   1325.784596  1.813417e+09
min       16.670000     16.670000     16.670000     16.670000  0.000000e+00
25%       89.625000     90.370003     88.884998     89.605000  1.072000e+07
50%      273.910004    275.619995    271.769989    273.910004  1.488000e+08
75%     1270.579956   1278.190002   1261.910034   1270.414978  2.516265e+09
max     6978.600098   7002.279785   6963.459961   7002.000000  1.145623e+10